programming/20230305165149-types_of_data_structs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Types of data structs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Types of data structs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc7c80e3">Linear Data Structures</a></li>
<li><a href="#org190a7fc">None Linear Data Structures</a></li>
<li><a href="#orgde62867">Static Data Structs</a></li>
<li><a href="#org176c923">Dynamic data structs</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc7c80e3" class="outline-2">
<h2 id="orgc7c80e3">Linear Data Structures</h2>
<div class="outline-text-2" id="text-orgc7c80e3">
<p>
A Linear data struct is one that is arranged sequentially in memory
They also have only one predeccesor and one successor
Examples:
</p>
<ul class="org-ul">
<li>Stack</li>
<li>Array</li>
<li>Queue</li>
<li>Linked list</li>
</ul>
</div>
</div>
<div id="outline-container-org190a7fc" class="outline-2">
<h2 id="org190a7fc">None Linear Data Structures</h2>
<div class="outline-text-2" id="text-org190a7fc">
<p>
A non linear data struct is one that is not arrange in a sequential order.
Examples:
</p>
<ul class="org-ul">
<li>Tree</li>
<li>Graph</li>
</ul>
</div>
</div>
<div id="outline-container-orgde62867" class="outline-2">
<h2 id="orgde62867">Static Data Structs</h2>
<div class="outline-text-2" id="text-orgde62867">
<p>
memory is allocated at compile time
Max size is always fixed
</p>

<p>
Examples:
</p>
<ul class="org-ul">
<li>Array</li>
</ul>
</div>
</div>


<div id="outline-container-org176c923" class="outline-2">
<h2 id="org176c923">Dynamic data structs</h2>
<div class="outline-text-2" id="text-org176c923">
<p>
memory is allocated at run time, it is flexible
</p>

<p>
Example:
</p>
<ul class="org-ul">
<li>Linked list</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
